In [1]:
import sqlite3
import pandas as pd
import numpy as np

In [2]:
connection = sqlite3.connect("test.db")
cursor = connection.cursor()

In [3]:
def read_query(query, cursor):
    cursor.execute(query)
    result = cursor.fetchall()
    attr_arr = cursor.description
    attr = []
    for val in attr_arr:
        attr.append(val[0])
    json_res = []
    for user in result:
        obj = {}
        for i in range(len(attr)):
            obj[attr[i]] = user[i]
        json_res.append(obj)
    
    return json_res

In [4]:
query = "select * from courses"
result = read_query(query, cursor)
result

[{'code': 'CSE331', 'name': 'Software Engineering and Design Patterns'},
 {'code': 'CSE333', 'name': 'Database Management Systems'},
 {'code': 'CSE335', 'name': 'Operating Systems'},
 {'code': 'CSE365', 'name': 'Communication Engineering'},
 {'code': 'CSE325', 'name': 'Digital Signal Processing'},
 {'code': 'CSE345', 'name': 'Introduction to Data Science'}]

## Write appropriate queries and manipulate the data using python to create a **tabulation** dictionary like below

In [5]:
tabulation = {
    2121000001: {
      'Registration': 2121000001,
      'name': 'Adam',
      'CSE331': 90.0,
      'CSE333': 97.0,
      'CSE335': 93.5,
      'CSE365': 96.5,
      'CSE325': 88.5,
      'CSE345': 100.0
    },
    2121000002: {
      'Registration': 2121000002,
      'name': 'Alex',
      'CSE331': 62.0,
      'CSE333': 37.0,
      'CSE335': 49.5,
      'CSE365': 44.5,
      'CSE325': 53.5,
      'CSE345': 46.5
    },
    2121000003: {
      'Registration': 2121000003,
      'name': 'Aaron',
      'CSE331': 91.0,
      'CSE333': 75.0,
      'CSE335': 83.0,
      'CSE365': 83.0,
      'CSE325': 76.0,
      'CSE345': 91.0
    },
}

## Then you can display the result using the following cells

In [6]:
df = pd.DataFrame.from_dict(tabulation, orient='index')

In [7]:
df.head(10).style.hide_index()